controllers/ActivitylistController.php

    public function actionOrderActivity()
    {
        $Parms = Yii::$app->request->get();
        $Order  = new Activityorder();
        $res = $Order->findOrderByID($Parms);
        if (!empty($res)) return 0;
        $res = $Order->saveData($Parms);
---
INSERT INTO `activityorder` (`ActivityID`, `UserID`, `AddTime`) VALUES (2, 1, '2017-03-09 00:00:00')