models/Activityorder.php

INSERT INTO `activityorder` (`ActivityID`, `UserID`, `AddTime`) VALUES (3, 1, '2017-03-15 15:24:11')
---
    public function saveData($Parms){
        $ActivityID = (int) $Parms['ActivityID'];
        $UserID = (int) $Parms['UserID'];
        $this->ActivityID =  addslashes($ActivityID);
        $this->UserID = addslashes($UserID);
        $this->AddTime =  date('Y-m-d H:i:s');
        $res = $this->save();